WS-I/BP1.2/Messages/ComplexDataTypes/XmlFormatter/RpcLit/SoapWsdl.ComplexDataTypes.XmlFormatter.RpcLit_RetArrayString1D_Client_Request-2.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <a:Action s:mustUnderstand="1">http://tempuri.org/IComplexDataTypesRpcLit/RetArrayString1D</a:Action>
    <a:MessageID>urn:uuid:14889a4f-d4ce-452b-8b32-01764c8b6301</a:MessageID>
    <a:ReplyTo>
      <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
    </a:ReplyTo>
  </s:Header>
  <s:Body>
    <RetArrayString1D xmlns="http://tempuri.org/">
      <inArrayString1D xmlns:i="http://www.w3.org/2001/XMLSchema-instance" xmlns="">
        <string xmlns="http://schemas.microsoft.com/2003/10/Serialization/Arrays">One Element Array</string>
      </inArrayString1D>
    </RetArrayString1D>
  </s:Body>
</s:Envelope>